Repository: thiagojnunes/XboxPostcodeMonitor
Catalog: PostCodeSerialMonitor/Assets/Resources.*.resx
Languages: pt_br

# ExpectedStringToken
source: Expected a string token
pt_br: Era esperado uma string de token

# FailedReadingString
source: Failed reading field as string
pt_br: Falha ao ler o campo como um texto

# InvalidBase64String
source: Invalid base64-urlsafe string
pt_br: Texto base64-urlsafe inválido

# ConfigurationSaved
source: Configuration saved successfully
pt_br: Configuração salva com sucesso

# FailedSaveConfiguration
source: Failed to save configuration
pt_br: Falha ao salvar a configuração

# ConfigurationUpdated
source: Configuration updated successfully
pt_br: Configuração atualizada com sucesso

# FailedUpdateConfiguration
source: Failed to update configuration
pt_br: Falha ao atualizar a configuração

# MetaFileNotExist
source: LoadMetaDefinitions: File {0} does not exist
pt_br: LoadMetaDefinitions: Arquivo {0} não existe

# UnexpectedMetaType
source: LoadMetaDefinitions: Unexpected MetaType: {0}
pt_br: LoadMetaDefinitions: Tipo de MetaType inesperado: {0}

# MetaContent
source: Meta content: {0}
pt_br: Conteúdo de Meta: {0}

# FailedDownloadMetaEntry
source: Failed to download MetaEntry {0}
pt_br: Falha ao baixar MetaEntry {0}

source: Failed deserializing MetaDefinition
pt_br: Falha ao deserializar MetaDefinition

# FailedDownloadMetaDefinition
source: Failed to download MetaDefinition from {0}
pt_br: Falha ao baixar MetaDefinition de {0}

source: Failed deserializing ReleaseDefinition
pt_br: Falha ao deserializar ReleaseDefinition

# FailedDownloadReleaseDefinition
source: Failed to download latest release from {0}
pt_br: Falha ao baixar o último lançamento de {0}

# DecoderIgnoringLine
source: Decoder: Ignoring line {0}
pt_br: Decodificador: Ignorando linha {0}

# FailedEnterRepl
source: Failed to enter REPL. Maybe you are using the wrong serial device?
pt_br: Falha ao entrar no modo REPL. Talvez você esteja usando a porta serial errada?

# FailedFwVersion
source: Failed to parse version information. Are you on FW v0.2.3 or greater?
pt_br: Falha ao processar a informação sobre a versão. Você está usando o firwmare v0.2.3 ou superior?

# FailedParseConfig
source: Failed to parse config information.
pt_br: Falha ao processar as informações de configuração.

# FailedGetVersion
source: Failed to get version reply!
pt_br: Falha para obter resposta do comando version!

# FailedGetState
source: Failed to get config state!
pt_br: Falha para obter o estado da configuração!

source: Unavailable
pt_br: Indisponível

# ScanButtonText
source: Press button to scan
pt_br: Pressione para escanear

source: Not connected
pt_br: Não conectado

source: Never
pt_br: Nunca

# NewMetadataAvailable
source: A new metadata definition is available.
pt_br: Uma nova versão de definição do metadata está disponível.

# NewMetadataAvailableInformation
source: This update contains the latest post codes and error definitions for your console. Would you like to update?
pt_br: Esta atualização contém os códigos de post e definições de erro mais recentes para o seu console. Você gostaria de atualizar?

# FailedUpdateMetadata
source: Failed to update metadata
pt_br: Falha ao ataulizar o metadata

# NewAppReleaseAvailable
source: A new app release is available at {0}.
pt_br: Uma nova versão do aplicativo está disponível em {0}.

# NewFirmwareReleaseAvailable
source: A new firmware release is available at {0}.
pt_br: Uma nova versão do firmware está disponível em {0}.

source: Error
pt_br: Erro

source: Warning
pt_br: Aviso

# FailedUpdateMetadataMessageBoxError
source: Failed to update metadata: {0}
pt_br: Falha ao atualizar o medata: {0}

# FailedLoadLocalMetadata
source: Failed to load local metadata definition
pt_br: Falha ao carregar a definição local de metadata

# FailedLoadLocalMetadataMessageBoxWarning
source: Failed to load local metadata definition. The application will continue without metadata.
pt_br: Falha ao carregar a definição local de metadata. A aplicação continuará sem o metadata.

# FailedLoadMetadata
source: Failed to load metadata definitions
pt_br: Falha ao carregar as definições de metadata

# FailedLoadLocalMetadataMessageBoxError
source: Failed to load metadata definitions: {0}
pt_br: Falha ao carregar as definições de metadata: {0}

# SaveLogFiles
source: Save Log File
pt_br: Salvar Arquivo Log

source: Log Files
pt_br: Arquivos Log

source: Error saving log file
pt_br: Erro ao salvar o arquivo de log

# ErrorSavingLogFileMessageBoxError
source: Failed saving logfile: {0}
pt_br: Erro ao salvar o arquivo de log: {0}

# ErrorConection
source: Connection error
pt_br: Erro de conexão

# ErrorConectionMessageBoxError
source: Connection to serialport failed: {0}
pt_br: Falha ao conectar na porta serial: {0}

# FailedGetMainWindow
source: Failed to get MainWindow
pt_br: Falha para obter MainWindow

# FailedGetApplicationLifetime
source: Failed to get ApplicationLifetime
pt_br: Falha para obter ApplicationLifetime

source: Configuration
pt_br: Configuração

source: Language Settings
pt_br: Configurações de Idioma

source: Update Settings
pt_br: Configurações de Atualização

# CheckApplicationUpdates
source: Check for application updates
pt_br: Verifique atualizações do aplicativo

source: Application update URL
pt_br: URL de atualização do aplicativo

# CheckCodeUpdates
source: Check for code updates
pt_br: Verifique atualizações dos códigos

# CodeMetaUrl
source: Code meta definition URL
pt_br: URL do arquivo meta de códigos

# CheckFirmwareUpdates
source: Check for firmware updates
pt_br: Verifique atualizações de firmware

source: Firmware update URL
pt_br: URL de atualização do firmware

source: Cancel
pt_br: Cancelar

source: Save
pt_br: Salvar

source: Refresh Ports
pt_br: Atualizar portas

source: Connect
pt_br: Conectar

source: Disconnect
pt_br: Desconectar

source: Save Log
pt_br: Salvar Log

source: App Version:
pt_br: Versão do App:

# VisitXboxResearch
source: Visit XboxResearch.com
pt_br: Visite XboxResearch.com

# FailedOpenUrl
source: Failed to open URL: {0}
pt_br: Falha ao abrir URL: {0}

source: Restart required
pt_br: Necessário reiniciar

# LanguageChangedPleaseRestart
source: Language was changed. Please restart the application for it to take effect.
pt_br: O idioma foi alterado. Reinicie o aplicativo para que a alteração entre em vigor.
